# Missing Data

Some datasets contains invalid/missing data.  
For example, a dataframe can contain nan (not a number).

The pandas library provides methods for data cleaning.


**Note** To create  a custom csv file containing missing values, write two consecutive commas in the csv file (without **any** character between them).  

Example:  
Cat1, Cat2, Cat3  
Val1, Val2, Val3  
Val4,, Val5

This will yield a dataframe (when loaded using pandas.read_csv) with two rows, whereas the second row is missing the value for category 2.

**Note** White spaces are important in csv files.  
Example:  
cat1, cat2 => two categories: 'cat1' and ' cat2' (note the preceeding space)

cat1,cat2 => 'cat1' and 'cat2' (the correct way)

In [1]:
import pandas as pd

## dropna

[Docs](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html#pandas-dataframe-dropna)

In [8]:
dataframe = pd.read_csv('./data_sample2.csv')

In [9]:
dataframe.head()

      Name   Age     Location
0   Caesar  28.0       Israel
1    Mario  18.0       Canada
2     Pepe  42.0   Wonderland
3      Neo  30.0   The Matrix
4  Trinity   NaN   The Matrix

In [10]:
clean_dataframe = dataframe.dropna(axis=0)
clean_dataframe.head()

     Name   Age     Location
0  Caesar  28.0       Israel
1   Mario  18.0       Canada
2    Pepe  42.0   Wonderland
3     Neo  30.0   The Matrix

This operation can be done in-place, i.e, without using extra space.  
Particularly useful when handling large dataframes.

In [11]:
dataframe.dropna(inplace=True, axis=0)
dataframe.head()

     Name   Age     Location
0  Caesar  28.0       Israel
1   Mario  18.0       Canada
2    Pepe  42.0   Wonderland
3     Neo  30.0   The Matrix